IRP/src/Documents/Issue/Issue.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Issue</name>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>CatalogRef.Cities</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.ObjectLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>IssueType</name>
    <type>
      <types>CatalogRef.IssueTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>IssueDetails</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Latitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Longitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Project</name>
    <type>
      <types>CatalogRef.Projects</types>
    </type>
  </attributes>
  <attributes>
    <name>Assignee</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Projects/Projects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Projects</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>JobDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IssueType</name>
    <type>
      <types>CatalogRef.IssueTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LocationList</name>
    <attributes>
      <name>Location</name>
      <type>
        <types>CatalogRef.Locations</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocIssueServer/Module.bsl
#Region FORM

Procedure OnCreateAtServer(Object, Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServer(Object, Form, Cancel, StandardProcessing);
	ViewServer_V2.OnCreateAtServer(Object, Form, "");
EndProcedure

Procedure AfterWriteAtServer(Object, Form, CurrentObject, WriteParameters) Export
	Return;
EndProcedure

Procedure OnReadAtServer(Object, Form, CurrentObject) Export
	LockDataModificationPrivileged.LockFormIfObjectIsLocked(Form, CurrentObject);
EndProcedure

#EndRegion

#Region LIST_FORM

Procedure OnCreateAtServerListForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerListForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region CHOICE_FORM

Procedure OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing) Export
	DocumentsServer.OnCreateAtServerChoiceForm(Form, Cancel, StandardProcessing);
EndProcedure

#EndRegion

#Region Generate

Function GetLocationIssuesBasedOnProject(Project) Export
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	ProjectsLocationList.Ref AS Project,
		|	ProjectsLocationList.Location AS Location
		|INTO Locations
		|FROM
		|	Catalog.Projects.LocationList AS ProjectsLocationList
		|WHERE
		|	ProjectsLocationList.Ref = &ProjectRef
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	Issue.Ref AS Issue,
		|	Locations.Location AS Location,
		|	Locations.Project AS Project
		|INTO IssueList
		|FROM
		|	Locations AS Locations
		|		LEFT JOIN Document.Issue AS Issue
		|		ON Locations.Project = Issue.Project
		|			AND Locations.Location = Issue.Location AND Issue.Posted		
		|	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	IssueList.Location AS Location
		|FROM
		|	IssueList AS IssueList
		|WHERE
		|	IssueList.Issue IS NULL";
	
	Query.SetParameter("ProjectRef", Project);
	
	Return Query.Execute().Unload().UnloadColumn("Location");
	
EndFunction

Procedure CreateIssueBasedOnLocations(Project, LocationList) Export
	For Each Location In LocationList Do
		Issue = Documents.Issue.CreateDocument();
		Issue.Date = Project.StartDate;
		Issue.Country = Location.Parent.City.Owner;
		Issue.City = Location.Parent.City;
		Issue.Location = Location;
		Issue.IssueType = Project.IssueType;
		Issue.IssueDetails = Project.JobDescription;
		Issue.DueDate = Project.DueDate;
		Issue.Project = Project; 
		Try
			Issue.Write(DocumentWriteMode.Posting);
			CommonFunctionsClientServer.ShowUsersMessage(Issue.Ref, , , , Issue.Ref);
		Except
			ErrorInfo = ErrorInfo();
			Log.Write("Write new Issue", ErrorProcessing.DetailErrorDescription(ErrorInfo));
			CommonFunctionsClientServer.ShowUsersMessage(ErrorProcessing.BriefErrorDescription(ErrorInfo));
		EndTry;

	EndDo;
EndProcedure

#EndRegion
